fix: migrated to mermaid diagram
